Revit 2026 API

# WoodWoodAxialNoise Property

---

The property labeled "Axial Noise" from the "Wood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WoodAxialNoise { get; }
```
```vb
Public Shared ReadOnly Property WoodAxialNoise As String
	Get
```
```cpp
public:
static property String^ WoodAxialNoise {
	String^ get ();
}
```
```fsharp
static member WoodAxialNoise : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 100".

#### Reference

Wood Class

Autodesk.Revit.DB.Visual Namespace